import matplotlib.pyplot as plt
x = [i + 1 for i in range(17)]
y1 = [0, 0, 0, 0, 9.402, 6.534, 4.686, 7.960, 6.943, 4.030, 5.180, 7.651, 2.344, 0.901, 0.901, 0.601, 0.400]
y2 = [3.977, 7.317, 8.888, 0.939, 1.288, 6.043, 8.528, 0.475, 2.866, 6.770, 27.992, 13.544, 9.171, 11.224, 34.089, 14.232, 0.5352]
y3 = [0, 0, 7.693, 25.476, 3.667, 13.354, 1.778, 3.788, 12.158, 14.260, 12.910, 1.450, 0.319, 0.164, 0.041, 0.224, 0.588]
# Построение графика
plt.xlabel("Кол-во используемых значений для вычисления стоимости товара на следующий месяц")
plt.ylabel("Cреднее значение относительной погрешности")
plt.plot(x, y1, label = "Первый товар")
plt.plot(x, y2, label = "Второй товар")
plt.plot(x, y3, label = "Третий товар")
plt.legend()
plt.show()

