import random as rnd
from faker import Faker


class Product:
    products = {"благоустройство" : ["плитка", "газонная трава", "сетка", "забор", "урна", "отпугиватель грызунов", "ловушка для насекомых", "брусчатка", "кафель", "бордюрный камень", "светильник", "фонарь"],
                "бытовая техника" : ["холодильник", "электрическая плита", "газовая плита", "стиральная машина", "посудомойка", "сушильная машина", "духовой шкаф", "кофеварка", "кофемашина", "чайник", "электрический чайник", "миксер", "блендер", "гриль", "пылесос", "утюг", "вентилятор", "обогреватель"],
                "электротехника" : ["лампа накаливания", "лампа светодиодная", "энергосберегающая лампа", "люминесцентная лампа", "светодиодная лента", "настольная лампа", "трансформатор", "удлинитель", "кабель ВВГ", "кабель ПВС", "кабель ШВВП", "акустический кабель"],
                "галантерея" : ["ленты", "тесьма", "шнуры", "кружева", "нитки", "косынка", "галстук", "подвязка",  "гребень", "расческа", "пуговицы", "мыльница", "запонки", "игла", "булавка", "пряжка", "крючок"],
                "детские товары" : ["детская коляска", "подгузники", "горшок", "детская смесь", "игрушка", "конструктор", "кукла", "фигурка", "настольная игра", "пазл", "платилин"],
                "домашние животные" : ["кошка", "кот", "собака", "хомяк", "рыбка", "черепаха", "крыса", "мышь", "кролик", "лошадь", "хорёк", "лягушка", "ящерица", "попугай", "змея"],
                "инструменты" : ["плоскогубцы", "болгарка", "дрель", "отвертка крестовая", "отвертка плоская", "шуруповёрт", "строительный нож", "рулетка", "строительная линейка", "строительный степлер", "кусачки", "гаечный ключ", "лобзик", "пила", "перфоратор", "шлифовальная машина", "отбойный молоток"],
                "мебель" : ["диван", "кресло", "стул", "табуретка", "кровать", "кресло-кровать", "тумбочка", "шкаф", "стол", "скамейка"],
                "медицинские изделия" : ["шпритц", "пластырь", "термометр", "одноразовые перчатки", "протез", "имплант", "бандаж", "бинт", "вата", "банка для анализов"],
                "обувь" : ["валенки", "сапоги", "сапожки", "полусапоги", "полусапожки", "ботинки", "полуботинки", "туфли", "сандалии", "туфли комнатные", "чувяки", "мокасины", "кроссовки", "опанки", "таби"],
                "одежда" : ["кофта", "куртка", "футболка", "штаны", "джинсы", "юбка", "носки", "худи", "толстовка", "блуза", "жилет", "трусы", "платье", "пальто", "плащ", "пиджак", "свитер", "майка", "шорты", "плавки"],
                "оптические приборы" : ["микроскоп", "телескоп", "бинокль", "оптический прицел", "дальномер", "прожектор", "диаскоп", "спектрометр", "спекрограф"],
                "отдых" : ["палатка", "раскладной стол", "раскладной стул", "спальник", "коврик", "термоодеяло", "рюкзак", "термокостюм", "термосумка", "термос", "мангал"],
                "продукты питания" : ["хлеб черный", "хлеб белый", "морковь", "капуста", "огурцы", "чеснок", "лук", "помидоры", "яблоки", "бананы", "апельсины", "чечевица", "пшено", "гречка", "фасоль", "рис", "миндаль", "арахис", "сыр", "йогурт", "масло сливочное", "молоко", "яйца", "говядина", "курица", "телятина", "тунец", "креветки", "сельдь", "лосось"],
                "промышленное оборудование" : ["фрезерный станок", "шлифовальная машина", "механический пресс", "гидравлический пресс", "электросварка", "оборудование для нанесения металлопокрытий", "лазерная сварка"],
                "религиозные и ритуальные услуги" : ["надгробие", "венок", "крест православный", "крест католический", "гроб дубовый", "гроб еловый", "гроб березовый", "искуственные цветы"],
                "сельское хозяйство" : [""],
                "системы охраны и безопасности" : [],
                "спортивные товары" : [],
                "строительство и ремонт" : [],
                "сырье и полезные ископаемые" : ["уголь", "железо", "золото", "алмаз", "лазурит", "древесный уголь"],
                "текстиль" : [],
                "товары для дома" : [],
                "товары для личного потребления" : [],
                "торговое оборудование" : [],
                "транспорт" : [],
                "техника" : [],
                "запчасти" : [],
                "химическая промышленность" : [],
                "электротовары" : [],
                "ювелирные изделия" : [],
                "подарки" : []
                }

    
    
    def GenTable(n, csvfilename):
        table = [0] * n

        for i in range(n):
            pass

